# Parameter Type Id Sheet Primary Title Block Property

Source: https://www.revitapidocs.com/2026/bf9b457d-1231-10c4-e595-73e52cf4ff88.htm

---

| Parameter Type Id Sheet Primary Title Block Property |
| --- |

"Primary Title Block"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId SheetPrimaryTitleBlock { get; }
```

```
Public Shared ReadOnly Property SheetPrimaryTitleBlock As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ SheetPrimaryTitleBlock {
	ForgeTypeId^ get ();
}
```

```
static member SheetPrimaryTitleBlock : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace